results/20251229_170812_haproxy_passthrough/runs/run_1.txt
Running 1m test @ http://localhost:8080/
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.77ms    3.46ms  80.05ms   90.19%
    Req/Sec     3.86k   391.35     4.76k    73.54%
  Latency Distribution
     50%    6.03ms
     75%    7.25ms
     90%    9.48ms
     99%   21.73ms
  921005 requests in 1.00m, 11.75GB read
Requests/sec:  15348.14
Transfer/sec:    200.44MB