results/20251229_170812_haproxy_passthrough/runs/run_2.txt
Running 1m test @ http://localhost:8080/
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.51ms    2.94ms  52.02ms   87.83%
    Req/Sec     3.97k   377.05     4.74k    73.50%
  Latency Distribution
     50%    5.88ms
     75%    7.03ms
     90%    9.06ms
     99%   19.50ms
  948688 requests in 1.00m, 12.10GB read
Requests/sec:  15809.80
Transfer/sec:    206.47MB