results/20251229_170812_haproxy_passthrough/runs/run_3.txt
Running 1m test @ http://localhost:8080/
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     7.80ms    4.49ms 103.57ms   92.19%
    Req/Sec     3.37k   627.44     4.66k    68.67%
  Latency Distribution
     50%    6.88ms
     75%    8.62ms
     90%   10.95ms
     99%   25.19ms
  804511 requests in 1.00m, 10.26GB read
Requests/sec:  13404.90
Transfer/sec:    175.06MB